Configuration/Documents/Награждение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Награждение</Name>
			<BasedOn>
				<xr:Item>Document.ПредставлениеКНаграде</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПредставленийКНаградам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПретендентыКНаграждению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Претендент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПретендентКНаграждению</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Enums/СтатусыПредставленияКНаградам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПредставленияКНаградам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаградаВручена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Documents/Награждение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	ПроцессыНаграждения.СформироватьДвиженияДокументовНаграждения(Ссылка, Движения, ДанныеДляПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроцессыНаграждения.ОчиститьНаградыФизическихЛиц(Ссылка);
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредставлениеКНаграде") Тогда
		
		ДанныеНовогоДокумента = Документы.Награждение.ДанныеНовогоДокумента();
		
		РеквизитыЗаполнения = "Организация,МотивПоощрения";
		ЗаполнитьЗначенияСвойств(ДанныеНовогоДокумента, ДанныеЗаполнения, РеквизитыЗаполнения);
		ДанныеНовогоДокумента.Дата = ДанныеЗаполнения.ДатаВручения;
		
		Для Каждого СтрокаПретендента Из ДанныеЗаполнения.ПретендентыКНаграждению Цикл
			Если СтрокаПретендента.Статус = Перечисления.СтатусыПредставленияКНаградам.Согласовано Тогда
				ЗаполнитьЗначенияСвойств(ДанныеНовогоДокумента.Претенденты.Добавить(), СтрокаПретендента, "Претендент,Награда");
			КонецЕсли;
		КонецЦикла;
		
		ЗаполнитьПоДаннымЗаполнения(ДанныеНовогоДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КонтейнерОшибок = Неопределено;

	ПретендентыКНаграждениюСвернуто = ПретендентыКНаграждению.Выгрузить();
	ПретендентыКНаграждениюСвернуто.Свернуть("Претендент,Награда");
	
	Если Не ПретендентыКНаграждению.Количество() = ПретендентыКНаграждениюСвернуто.Количество() Тогда
		
		Для Каждого УникальноеНаграждение Из ПретендентыКНаграждениюСвернуто Цикл
			
			НайденныеСтроки = ПретендентыКНаграждению.НайтиСтроки(Новый Структура("Претендент,Награда", УникальноеНаграждение.Претендент, УникальноеНаграждение.Награда));
			
			Если НайденныеСтроки.Количество() > 1 Тогда
				
				ТекстСообщения = НСтр("ru = 'Обнаружено дублирование строк по комбинации сотрудника / физического лица и награды'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПретендентыКНаграждению[%1].Претендент", ТекстСообщения, "",,, ПретендентыКНаграждению.Индекс(НайденныеСтроки[НайденныеСтроки.Количество()-1]));
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(КонтейнерОшибок, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	ДанныеДляПроведения = Новый Структура();
	ПроцессыНаграждения.ЗаполнитьДанныеДляПроведенияДокументаНаграждения(ДанныеДляПроведения, Ссылка);
	
	Возврат ДанныеДляПроведения;
	
КонецФункции 

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения)
	
	ДанныеЗаполнения.Свойство("Дата", Дата);
	ДанныеЗаполнения.Свойство("Организация", Организация);
	ДанныеЗаполнения.Свойство("Руководитель", Руководитель);
	ДанныеЗаполнения.Свойство("ДолжностьРуководителя", ДолжностьРуководителя);
	ДанныеЗаполнения.Свойство("ОснованиеПодписиРуководителя", ОснованиеПодписиРуководителя);
	ДанныеЗаполнения.Свойство("Ответственный", Ответственный);
	ДанныеЗаполнения.Свойство("МотивПоощрения", МотивПоощрения);
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	ЗапрашиваемыеЗначения = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		ЗапрашиваемыеЗначения.Вставить("Ответственный", "Ответственный");
	КонецЕсли;
	
	ФиксированныеЗначения = Новый Массив;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ЗапрашиваемыеЗначения.Вставить("Организация", "Организация");
		
		Если НЕ ЗначениеЗаполнено(Руководитель) Тогда
			ЗапрашиваемыеЗначения.Вставить("Руководитель", "Руководитель");
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ДолжностьРуководителя) Тогда
			ЗапрашиваемыеЗначения.Вставить("ДолжностьРуководителя", "ДолжностьРуководителя");
		КонецЕсли; 
		
		ФиксированныеЗначения.Добавить("Организация");
		
	КонецЕсли;
	
	ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ЭтотОбъект, ЗапрашиваемыеЗначения, ФиксированныеЗначения);
	
	ПретендентыКНаграждению.Очистить();
	
	ДанныеЗаполненияПретенденты = Неопределено;
	
	Если ДанныеЗаполнения.Свойство("Претенденты", ДанныеЗаполненияПретенденты) И ТипЗнч(ДанныеЗаполненияПретенденты) = Тип("ТаблицаЗначений") Тогда
		Для Каждого ДанныеПретендент Из ДанныеЗаполненияПретенденты Цикл
			
			Если ЗначениеЗаполнено(ДанныеПретендент.Претендент) Тогда
				
				СтрокаПретендент = ПретендентыКНаграждению.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПретендент, ДанныеПретендент);
				
				Если ЗначениеЗаполнено(СтрокаПретендент.Претендент) И ТипЗнч(СтрокаПретендент.Претендент) = Тип("СправочникСсылка.Сотрудники") Тогда
					Если СтрокаПретендент.Подразделение.Пустая() Тогда
						КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаПретендент.Претендент), "Подразделение", Дата);
						СтрокаПретендент.Подразделение = КадровыеДанные[0].Подразделение;
					КонецЕсли;
				Иначе
					СтрокаПретендент.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
